{
  "posts": [
    {
      "title": "台灣金屬創意館",
      "description": "台灣金屬創意館為第一座金屬造型觀光工廠，來這裡可讓大家看到並觸摸到金屬柔軟的一面，館區內充滿各種金屬的驚奇與創意，是一個極具觀光、休閒、知性與文化的好地方。",
      "id": 2
    },
    {
      "title": "石梯坪",
      "description": "石梯坪位在花蓮縣豐濱鄉石梯灣的南側，整個區域是一個面積極大的海岸階地，海蝕地形十分發達，海蝕平台、隆起珊瑚礁、海蝕溝、海蝕崖等比比皆是，尤其是壺穴景觀更是堪稱台灣第一。遊客可在此在此觀察潮間帶豐富生態或從事潛水活動，亦可選擇在設備完善的露營區夜宿。石梯坪主要族群是阿美族，夏天的捕魚祭和豐年祭為此處的主要活動，此處同時也是台灣賞鯨的發源地。",
      "id": 3
    },
    {
      "title": "長虹橋",
      "description": "長虹橋橫跨秀姑巒溪，連接靜浦與港口兩聚落，亦是秀姑巒溪泛舟的終點站；橋分新舊兩座橋，新橋採鮮艷亮眼的橙紅色，橋面規劃有快慢車道分隔的腳踏車及人行專用步道，並配合泛舟活動，設置了八座觀景台；橋上可遠眺出海囗的奚卜蘭島，因登島不易，島上仍維持原始林樣貌，俯瞰河面可見許多潔白如玉的大岩塊，其為巨型石灰岩，因其石潔白如玉，因而得到了「秀姑漱玉」的美名。",
      "id": 4
    },
    {
      "title": "金樽",
      "description": "金樽擁有臺灣唯一正在形成的陸連島，因看似酒杯，故取名為「金樽」，又因形狀像船錨，也被稱為「錨島」或「錨狀礁」。東管處在此地設有休憩區可俯瞰海岸全景，秀麗的海岸景色完全盡收眼底，還有木棧道通往沙灘，遊客可至綿延達三公里長的純淨沙灘遊玩，再回到觀景休憩區旁的咖啡店喝一杯香濃的麥飯石咖啡，堪稱一大享受。",
      "id": 5
    },
    {
      "title": "烏石鼻",
      "description": "烏石鼻位於台東縣長濱鄉南方寧埔村一片伸入海中的岬角，是火山活動熔岩噴發的產物。您可觀察到其岩體為一群群六邊形、五邊形的柱狀熔岩，地質學上稱為柱狀節理，是全台灣面積最大的柱狀火山成岩體。岩體上遍佈大大小小的潮池、海蝕溝等，居民會趁著退潮時前來撿拾海螺、海瓜子等，此時除了生態觀察外，亦是體驗長濱鄉人文風貌的好時機。",
      "id": 6
    },
    {
      "title": "阿美族民俗中心",
      "description": "位於東管處處本部園區內的阿美族民俗中心於1995年11月興建完成，現由知名的「Amis旮亙樂園」駐點經營，走訪這裡，可看出阿美族特有的居住文化，除了阿美族特色建築外，遊客在此還可進行拉鞦韆、射箭及竹炮等阿美族文化體驗，還有「Amis旮亙樂團」定點表演：舞蹈、歌唱、打擊樂器、排笛、鼻笛等，歡迎一起來唱跳。",
      "id": 7
    },
    {
      "title": "紫坪",
      "description": "紫坪位在綠島最南方，從附近的步道，可通往海岸邊的潟湖。此處是由珊瑚礁構成的潮池，也是綠島著名的潟湖所在地，有全綠島最完整的潟湖地形以及珊瑚礁植群，更有茂盛的植物水芫花和珍貴的陸寄居蟹。",
      "id": 8
    },
    {
      "title": "帆船鼻大草原",
      "description": "帆船鼻位於綠島東南角，有「綠島地毯」之稱，可由朝日溫泉售票口旁邊的小徑沿步道而上。由於地形突出，地勢又高出四周，屬東北季季風可長驅直入的衝風帶；再加上後天的放牧，遂形成低草原景觀。草原邊緣懸崖可以俯視朝日溫泉與海參坪，也是綠島居高臨下欣賞日出、月昇，沐浴海風的最佳景點之一，每年四、五月可觀賞到南十字星座丰采，每年春秋候更是賞鳥的極佳去處。",
      "id": 9
    },
    {
      "title": "哈巴狗與睡美人岩",
      "description": "睡美人岩與哈巴狗岩靜臥在海參坪上，是綠島最著名的景點之一，從小長城步道遠眺，可以見到睡美人靜靜地躺臥在海面上，白色的沙灘是她秀麗的長髮，而垂著長耳朵的哈巴狗靜臥在不遠處。天氣晴朗時，從遠處眺望哈巴狗與睡美人，可以有許多有趣的「錯位」拍攝玩法！堪稱是綠島最著名的景點。",
      "id": 10
    },
    {
      "title": "柴口浮潛區",
      "description": "早期稱為柵口，後來更名為「柴口」，為綠島主要浮潛區之一。海岸地形以珊瑚裙礁為主體，是綠島僅有的兩處沙灘之一。 此為初級潛水區，觀光局東管理處在此設置潛水步道，方便潛水客或浮潛人士下水，保護石珊瑚，以免被人為破壞。適合每年六月至八月前來從事浮潛活動，海域變化層次多、海底礁石林立，浮潛完也可觀察潮間帶生物。",
      "id": 11
    }
  ],
  "users": [
    {
      "email": "1@gmail.com",
      "password": "$2a$10$Rl5aEsRhcdgafWXbrYyTAuerNx/keKMGM3gw8OHNp6nGbCBtk84YW",
      "id": 1
    },
    {
      "email": "2@gmail.com",
      "password": "$2a$10$mRYRo2w4HarRRgMobpj1W.0NkVYeOf2VNxa4d2xNbh2rFysa3qm92",
      "id": 2,
      "role": "admin"
    },
    {
      "email": "3@gmail.com",
      "password": "$2a$10$23IuICzGyjudSLFtpFojy.tBPkgY103IT4aWsEH6DYLam6hyD/0xe",
      "id": 3
    }
  ],
  "collects": [
    {
      "postId": 4,
      "userId": 2,
      "id": 4
    },
    {
      "postId": 7,
      "userId": 2,
      "id": 6
    },
    {
      "postId": 5,
      "userId": 2,
      "id": 7
    }
  ],
  "profile": {
    "name": "typicode"
  }
}